app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "body", "rating", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["body", "very nice"], ["rating", 5], ["product_id", 1], ["created_at", "2017-11-18 15:11:40.319981"], ["updated_at", "2017-11-18 15:11:40.319981"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save