app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" IN (1, 2)
---
  def index
    @orders = Order.includes(:product, :user).where(user_id: current_user.id).all

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "product_id", "total") VALUES (?, ?, ?)  [["user_id", 1], ["product_id", 6], ["total", 20.0]]
---
  def create
    @product = Product.find(params[:product_id])
    @order = @product.orders.build(product: @product)
    @order.user = current_user
    @order.total = @product.price
    if @order.save