app/controllers/payments_controller.rb

	def create
 	  @product = Product.find(params[:product_id])
 	  @user = current_user

  	  token = params[:stripeToken]
  	  # Create the charge on Stripe's servers - this will charge the user's card
      begin
        charge = Stripe::Charge.create(
          amount: (@product.price * 100).to_i, # amount in cents, again
          currency: "usd",
          source: token,
          description: params[:stripeEmail],
          receipt_email: params[:stripeEmail]
        )

        if charge.paid
           Order.create(product_id: @product.id, user_id: @user.id, total: @product.price.to_i)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "product_id", "total") VALUES (?, ?, ?)  [["user_id", 1], ["product_id", 1], ["total", 30.0]]