app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name.downcase LIKE '%bag%')
SELECT MAX("products"."updated_at") FROM "products"
SELECT COUNT(*) FROM "products"
---
  def index
    if params[:q]
      search_term = params[:q]
      @products = Product.search(search_term)
      logger.debug "Product: #{@products}"
    else
      @products = Product.all
      logger.debug "Products number is: #{@products.length}"

SELECT  "comments".* FROM "comments" WHERE "comments"."product_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["product_id", 3], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 3]]
---
  def show
    @comments = @product.comments.order("created_at DESC").paginate(:page => params[:page], :per_page => 2)

INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at", "colour") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["description", ""], ["image_url", ""], ["created_at", "2017-11-05 06:17:02.030292"], ["updated_at", "2017-11-05 06:17:02.030292"], ["colour", ""]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "colour" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["colour", "Brown"], ["updated_at", "2017-11-02 08:12:21.571365"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)