app/views/products/show.html.erb

        <p>The lowest rating for this product is <%= @product.lowest_rating_comment.try(:rating) %> /5 with comment <%= @product.lowest_rating_comment.try(:body) %></p>
        <p>The comments for this product in desc order<%= Comment.rating_desc.pluck(:rating)%></p>
---
SELECT "comments"."rating" FROM "comments" ORDER BY "comments"."rating" DESC
SELECT AVG("comments"."rating") FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 2]]